Revit 2027 API
FailuresAccessor.IsActive Method
 Method allows to check if this instance of the accessor is currently active.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsActive()
Public Function IsActive As Boolean
public:
bool IsActive()
member IsActive : unit -> bool
Return Value
Boolean
 True if this instance is currently active and can be used.
Remarks
 Generally, this instance is active when it is passed to any of interfaces used in the process of failure resolution, and becomes inactive after returning control to Revit. The only special case is if failures processor returns WaitForUserInput, in which case document stays in the FailureMode and instance of failures accessor stays active till FailureMode is ended.
See Also
Reference
FailuresAccessor Class
Autodesk.Revit.DB Namespace